// На вход вашей функции maximin даётся зубчатый двумерный массив (сначала даётся число  n - количество строк,
// а потом сами строки). Найдите максимальное значение среди минимальных элементов каждой строки.
// Ввод
// 4
// 1 2 4 3 5
// 3 2 4 4
// 6 5 3 4 6 7 5
// 1 2 1 2 1 2 2 1 1
// Вывод
// 3
// Класс Integer предоставляет различные константы и методы для работы с целыми числами.
// Синтаксис: int имя_переменной = Integer.MIN_VALUE; int имя_переменной = Integer.MAX_VALUE;



public class pz_10_5 {
}
