//// Напишите функцию sortByLength, которая принимает как аргумент строку и сортирует её по длине слова.
//// Если длины слов одинаковы, то сортировать в алфавитном порядке. Содержание функции main менять запрещено.
////
////
////
////
//
//
//import java.util.Scanner;
//import java.util.Arrays;
//
//public class pz_10_4 {
//    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//
//        System.out.println("Введите число для проверки (a): ");
//        int a = scanner.nextInt();
//
//        System.out.println(sortByLength(a) ? "YES" : "NO");
//    }
//
//    public static boolean sortByLength(String ) {
//        if (number < 2) return false;
//        for (int i = 2; i <= number / 2; i++) {
//            if (number % i == 0) {
//                return false;
//            }
//        }
//        return true;
//    }
//}
