public class pz_9_5 {
}


/*
Словари и множества
Несколько друзей решили сыграть в игру: кто больше слов знает. Они сели за стол и стали записывать все слова, которые
только пришли им на ум. После чего стали сравнивать, у кого больше слов. В этот момент стало понятно, что некоторые
ребята по ошибке записали какие-то слова несколько раз. Разумеется, повторяющиеся слова вычеркнули. Потом они поняли,
что слов слишком много, поэтому решили считать только те, длина которых не меньше, чем K. Помогите ребятам узнать,
кто же знает больше слов. Гарантируется, что есть единственный победитель.
Сначала вводится число n - количество ребят. Затем идёт n строк вида:
"Имя ребёнка: слово1 слово2 слово3 и т.д."
После чего вводится число K.
Выведите на экран имя ребёнка и количество слов, которое он знает (они не должны повторяться,
и их длина должна быть не меньше К).
Учтите, что некоторые слова дети могут написать в разных регистрах. Например, слова "Слово" и
"слово" — это одно и то же.
*/